"""
Task 2

Создайте кортеж из имен людей.
Выведите все имена через цикл for по шаблону: "Привет, [ИМЯ]".
"""

tupleNames = ('Tilek','Aizhan', 'Dinara', 'Yesbol', 'Aselya')

for name in tupleNames:
    print(f'Привет {name}!')
